STMicroelectronics/OpenOCD/src/flash/nor/spc58xn.c
	/* did we assign flash size? */
	assert(flash_size_in_kb != 0xffff);

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _c55_ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};


	/* Default SSD values (keep them in target endianess) */
	uint32_t val;
	val = C55_REG_BASE;
    ssd->c55RegBase = fast_target_buffer_get_u32(&val, false);

    val = MAIN_ARRAY_BASE;
	ssd->mainArrayBase = fast_target_buffer_get_u32(&val, false);

    val = UTEST_ARRAY_BASE;
	ssd->uTestArrayBase = fast_target_buffer_get_u32(&val, false);

	val = C55_PROGRAMMABLE_SIZE;
	ssd->programmableSize = fast_target_buffer_get_u32(&val, false);


	ssd->lowBlockInfo.n16KBlockNum = 0;
	ssd->lowBlockInfo.n32KBlockNum = 0;
	ssd->lowBlockInfo.n64KBlockNum = 0;
	ssd->lowBlockInfo.n128KBlockNum = 0;

	ssd->midBlockInfo.n16KBlockNum = 0;
	ssd->midBlockInfo.n32KBlockNum = 0;
	ssd->midBlockInfo.n64KBlockNum = 0;
	ssd->midBlockInfo.n128KBlockNum = 0;

	ssd->highBlockInfo.n16KBlockNum = 0;
	ssd->highBlockInfo.n32KBlockNum = 0;
	ssd->highBlockInfo.n64KBlockNum = 0;
	ssd->highBlockInfo.n128KBlockNum = 0;

	ssd->nLargeBlockNum = 0;

	ssd->mainInterfaceFlag = 1;

	ssd->BDMEnable = 0;

	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
	{
		target_free_working_area(target, ssd_config);
		return err;
	}


	/* Flash initialization code */
	if (target_alloc_working_area(target, sizeof(spc58x_flash_init_code),
			&init_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash init step");
		target_free_working_area(target, ssd_config);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, init_algorithm->address,
			sizeof(spc58x_flash_init_code), (uint8_t *)spc58x_flash_init_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, init_algorithm);
		return err;
	}

	/* ssd_config (in), return value (out) */
	init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
	buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

	/*
	 * Link register (in).
	 * Set link register to the breakpoint instruction at the end of the buffer.
	 * We use a software breakpoint to notify when done with algorithm execution.
	 */
	init_reg_param(&reg_params[1], "lr", 32, PARAM_IN);
	//buf_set_u32(reg_params[1].value, 0, 32, init_algorithm->address + (init_algorithm->size - 2));
	buf_set_u32(reg_params[1].value, 0, 32, init_algorithm->address + (sizeof(spc58x_flash_init_code) - 2));
	//buf_set_u32(reg_params[1].value, 0, 32, 0x400a8164);

	/*
	* Stack Pointer (in).
	*/
	init_reg_param(&reg_params[2], "r1", 32, PARAM_IN);
	buf_set_u32(reg_params[2].value, 0, 32, target->working_area_phys + target->working_area_size - 1);

	err = target_run_algorithm(target,
			0, NULL,
			3, reg_params,
			init_algorithm->address, (init_algorithm->address + init_algorithm->size),
			5000, &powerpc_info);

	if ((err != ERROR_OK) || (buf_get_u32(reg_params[0].value, 0, 32) != 0)) {
		err = ERROR_TARGET_FAILURE;
		goto flash_init_error;
	}

	err = target_read_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK) {
		goto flash_init_error;
	}

	LOG_DEBUG("SDD->c55RegBase  = 0x%08x", fast_target_buffer_get_u32(&ssd->c55RegBase, false));
	LOG_DEBUG("SDD->mainArrayBase = 0x%08x", fast_target_buffer_get_u32(&ssd->mainArrayBase, false));
	LOG_DEBUG("SDD->uTestArrayBase = 0x%08x", fast_target_buffer_get_u32(&ssd->uTestArrayBase, false));

	LOG_DEBUG("SDD->lowBlockInfo->n16KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockInfo.n16KBlockNum, false));
	LOG_DEBUG("SDD->lowBlockInfo->n32KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockInfo.n32KBlockNum, false));
	LOG_DEBUG("SDD->lowBlockInfo->n64KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockInfo.n64KBlockNum, false));
	LOG_DEBUG("SDD->lowBlockInfo->n128KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockInfo.n128KBlockNum, false));

	LOG_DEBUG("SDD->midBlockInfo->n16KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockInfo.n16KBlockNum, false));
	LOG_DEBUG("SDD->midBlockInfo->n32KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockInfo.n32KBlockNum, false));
	LOG_DEBUG("SDD->midBlockInfo->n64KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockInfo.n64KBlockNum, false));
	LOG_DEBUG("SDD->midBlockInfo->n128KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockInfo.n128KBlockNum, false));

	LOG_DEBUG("SDD->highBlockInfo->n16KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockInfo.n16KBlockNum, false));
	LOG_DEBUG("SDD->highBlockInfo->n32KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockInfo.n32KBlockNum, false));
	LOG_DEBUG("SDD->highBlockInfo->n64KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockInfo.n64KBlockNum, false));
	LOG_DEBUG("SDD->highBlockInfo->n128KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockInfo.n128KBlockNum, false));

	LOG_DEBUG("SDD->nLargeBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->nLargeBlockNum, false));

	LOG_DEBUG("SDD->mainInterfaceFlag  = 0x%u", ssd->mainInterfaceFlag);
	LOG_DEBUG("SDD->programmableSize   = 0x%08x", fast_target_buffer_get_u32(&ssd->programmableSize, false));
	LOG_DEBUG("SDD->BDMEnable     = 0x%u", ssd->BDMEnable);

	if(bank->base == 0x00FC0000)
	{
		num_pages = 32;

		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc58xn_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 4, 16 * 1024);
		setup_sector(bank, 4, 2, 32 * 1024);
		setup_sector(bank, 6, 2, 64 * 1024);

